In [1]:
import numpy as np
import pandas as pd

In [2]:
Data={'Name':['Ashwin','Ankit','Shital','Anuja','Sneha','Suhani','Raghav','Raman','Komal','Raj','Reem','Nikita'],
      'Age':[25,26,35,32,40,36,27,28,24,41,43,23],
      'Salary':[40000,45000,26000,51000,32000,47000,36000,39000,54000,60000,58000,55000],
      'Gender':['Male','Male','Female','Female','Female','Female','Male','Male','Female','Male','Female','Female']}

In [3]:
df=pd.DataFrame(Data)

In [4]:
df

      Name  Age  Salary  Gender
0   Ashwin   25   40000    Male
1    Ankit   26   45000    Male
2   Shital   35   26000  Female
3    Anuja   32   51000  Female
4    Sneha   40   32000  Female
5   Suhani   36   47000  Female
6   Raghav   27   36000    Male
7    Raman   28   39000    Male
8    Komal   24   54000  Female
9      Raj   41   60000    Male
10    Reem   43   58000  Female
11  Nikita   23   55000  Female

In [5]:
df.shape

(12, 4)

In [6]:
#size
df.size

48

In [7]:
#dimension
df.ndim

2

In [8]:
#list all columns 
df.columns

Index(['Name', 'Age', 'Salary', 'Gender'], dtype='object')

In [9]:
#datatype of each column
df.dtypes

Name      object
Age        int64
Salary     int64
Gender    object
dtype: object

In [10]:
#axes
df.axes

[RangeIndex(start=0, stop=12, step=1),
 Index(['Name', 'Age', 'Salary', 'Gender'], dtype='object')]

In [11]:
#index of dataframe
df.index

RangeIndex(start=0, stop=12, step=1)

In [12]:
#all values of df
df.values

array([['Ashwin', 25, 40000, 'Male'],
       ['Ankit', 26, 45000, 'Male'],
       ['Shital', 35, 26000, 'Female'],
       ['Anuja', 32, 51000, 'Female'],
       ['Sneha', 40, 32000, 'Female'],
       ['Suhani', 36, 47000, 'Female'],
       ['Raghav', 27, 36000, 'Male'],
       ['Raman', 28, 39000, 'Male'],
       ['Komal', 24, 54000, 'Female'],
       ['Raj', 41, 60000, 'Male'],
       ['Reem', 43, 58000, 'Female'],
       ['Nikita', 23, 55000, 'Female']], dtype=object)

In [13]:
#check dataframe is empty
df.empty

False

In [14]:
#transpose
df.T

,0,1,2,3,4,5,6,7,8,9,10,11
Name,Ashwin,Ankit,Shital,Anuja,Sneha,Suhani,Raghav,Raman,Komal,Raj,Reem,Nikita
Age,25,26,35,32,40,36,27,28,24,41,43,23
Salary,40000,45000,26000,51000,32000,47000,36000,39000,54000,60000,58000,55000
Gender,Male,Male,Female,Female,Female,Female,Male,Male,Female,Male,Female,Female

In [15]:
#detailed info of database
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    12 non-null     object
 1   Age     12 non-null     int64
 2   Salary  12 non-null     int64
 3   Gender  12 non-null     object
dtypes: int64(2), object(2)
memory usage: 512.0+ bytes

In [16]:
df.head()

     Name  Age  Salary  Gender
0  Ashwin   25   40000    Male
1   Ankit   26   45000    Male
2  Shital   35   26000  Female
3   Anuja   32   51000  Female
4   Sneha   40   32000  Female

In [17]:
df.tail()

      Name  Age  Salary  Gender
7    Raman   28   39000    Male
8    Komal   24   54000  Female
9      Raj   41   60000    Male
10    Reem   43   58000  Female
11  Nikita   23   55000  Female

In [18]:
df.describe()

             Age        Salary
count  12.000000     12.000000
mean   31.666667  45250.000000
std     7.139306  10813.501661
min    23.000000  26000.000000
25%    25.750000  38250.000000
50%    30.000000  46000.000000
75%    37.000000  54250.000000
max    43.000000  60000.000000

In [19]:
df['Age'].min()

23

In [20]:
df['Age'].max()

43

In [21]:
df['Age'].mean()

31.666666666666668

In [22]:
df['Age'].median()

30.0

In [23]:
df['Age'].mode()

0     23
1     24
2     25
3     26
4     27
5     28
6     32
7     35
8     36
9     40
10    41
11    43
Name: Age, dtype: int64

In [24]:
df['Age'].std()

7.139306476801298

In [25]:
df['Age'].unique()

array([25, 26, 35, 32, 40, 36, 27, 28, 24, 41, 43, 23], dtype=int64)

In [26]:
df['Salary'].min()

26000

In [27]:
df['Salary'].max()

60000

In [28]:
df['Salary'].mean()

45250.0

In [29]:
df['Salary'].median()

46000.0

In [30]:
df['Salary'].mode()

0     26000
1     32000
2     36000
3     39000
4     40000
5     45000
6     47000
7     51000
8     54000
9     55000
10    58000
11    60000
Name: Salary, dtype: int64

In [31]:
df['Salary'].std()

10813.501661433182

In [32]:
df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [33]:
df['Gender'].nunique() # Count of unique elements

2

In [34]:
df['Gender'].value_counts()

Gender
Female    7
Male      5
Name: count, dtype: int64

In [35]:
df['Gender'].value_counts(ascending=True)

Gender
Male      5
Female    7
Name: count, dtype: int64

In [36]:
df.sample(5) # Randomly samples the data from population(ex.Surveys)

      Name  Age  Salary  Gender
7    Raman   28   39000    Male
2   Shital   35   26000  Female
10    Reem   43   58000  Female
1    Ankit   26   45000    Male
3    Anuja   32   51000  Female

In [37]:
df.sample(8)

      Name  Age  Salary  Gender
3    Anuja   32   51000  Female
5   Suhani   36   47000  Female
1    Ankit   26   45000    Male
4    Sneha   40   32000  Female
9      Raj   41   60000    Male
2   Shital   35   26000  Female
11  Nikita   23   55000  Female
7    Raman   28   39000    Male

In [38]:
df.sample(3)

      Name  Age  Salary  Gender
0   Ashwin   25   40000    Male
11  Nikita   23   55000  Female
10    Reem   43   58000  Female

In [39]:
#20 locate the first, nth row in df. display the df first
df

      Name  Age  Salary  Gender
0   Ashwin   25   40000    Male
1    Ankit   26   45000    Male
2   Shital   35   26000  Female
3    Anuja   32   51000  Female
4    Sneha   40   32000  Female
5   Suhani   36   47000  Female
6   Raghav   27   36000    Male
7    Raman   28   39000    Male
8    Komal   24   54000  Female
9      Raj   41   60000    Male
10    Reem   43   58000  Female
11  Nikita   23   55000  Female

In [40]:
#locate first row
df.loc[0]

Name      Ashwin
Age           25
Salary     40000
Gender      Male
Name: 0, dtype: object

In [41]:
df.loc[6]

Name      Raghav
Age           27
Salary     36000
Gender      Male
Name: 6, dtype: object

In [42]:
#locate all values in df using range
df.loc[1:5]

     Name  Age  Salary  Gender
1   Ankit   26   45000    Male
2  Shital   35   26000  Female
3   Anuja   32   51000  Female
4   Sneha   40   32000  Female
5  Suhani   36   47000  Female

In [43]:
df.loc[2:7]

     Name  Age  Salary  Gender
2  Shital   35   26000  Female
3   Anuja   32   51000  Female
4   Sneha   40   32000  Female
5  Suhani   36   47000  Female
6  Raghav   27   36000    Male
7   Raman   28   39000    Male

In [44]:
df.loc[df['Age']>30,]

      Name  Age  Salary  Gender
2   Shital   35   26000  Female
3    Anuja   32   51000  Female
4    Sneha   40   32000  Female
5   Suhani   36   47000  Female
9      Raj   41   60000    Male
10    Reem   43   58000  Female

In [47]:
df.loc[(df['Age']>20) & (df['Age']<30)]

      Name  Age  Salary  Gender
0   Ashwin   25   40000    Male
1    Ankit   26   45000    Male
6   Raghav   27   36000    Male
7    Raman   28   39000    Male
8    Komal   24   54000  Female
11  Nikita   23   55000  Female

In [49]:
df.iloc[:,-1]

0       Male
1       Male
2     Female
3     Female
4     Female
5     Female
6       Male
7       Male
8     Female
9       Male
10    Female
11    Female
Name: Gender, dtype: object

In [50]:
df.iloc[:-1]

      Name  Age  Salary  Gender
0   Ashwin   25   40000    Male
1    Ankit   26   45000    Male
2   Shital   35   26000  Female
3    Anuja   32   51000  Female
4    Sneha   40   32000  Female
5   Suhani   36   47000  Female
6   Raghav   27   36000    Male
7    Raman   28   39000    Male
8    Komal   24   54000  Female
9      Raj   41   60000    Male
10    Reem   43   58000  Female

In [52]:
df.iloc[0:-1]

      Name  Age  Salary  Gender
0   Ashwin   25   40000    Male
1    Ankit   26   45000    Male
2   Shital   35   26000  Female
3    Anuja   32   51000  Female
4    Sneha   40   32000  Female
5   Suhani   36   47000  Female
6   Raghav   27   36000    Male
7    Raman   28   39000    Male
8    Komal   24   54000  Female
9      Raj   41   60000    Male
10    Reem   43   58000  Female

In [54]:
df.loc[0:5]

     Name  Age  Salary  Gender
0  Ashwin   25   40000    Male
1   Ankit   26   45000    Male
2  Shital   35   26000  Female
3   Anuja   32   51000  Female
4   Sneha   40   32000  Female
5  Suhani   36   47000  Female

In [60]:
df.iloc[:,0:3]

      Name  Age  Salary
0   Ashwin   25   40000
1    Ankit   26   45000
2   Shital   35   26000
3    Anuja   32   51000
4    Sneha   40   32000
5   Suhani   36   47000
6   Raghav   27   36000
7    Raman   28   39000
8    Komal   24   54000
9      Raj   41   60000
10    Reem   43   58000
11  Nikita   23   55000

In [67]:
df.loc[df["Name"]=="Raj"]

  Name  Age  Salary Gender
9  Raj   41   60000   Male

In [69]:
df.iloc[[0,5],[0,3]]

     Name  Gender
0  Ashwin    Male
5  Suhani  Female

In [71]:
df.to_excel('Data.xlsx')

In [72]:
print("Hello world ")

Hello world